Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/atdf/PIC32CM1216LE00100.atdf
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Enable" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8 Enable" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9 Enable" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10 Enable" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11 Enable" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12 Enable" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13 Enable" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14 Enable" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15 Enable" mask="0x8000"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT0" caption="External Interrupt 0" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="ASYNCH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Asynchronous Mode">
          <bitfield name="ASYNCH0" caption="Asynchronous Edge Detection Mode of EXTINT0" mask="0x1" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH1" caption="Asynchronous Edge Detection Mode of EXTINT1" mask="0x2" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH2" caption="Asynchronous Edge Detection Mode of EXTINT2" mask="0x4" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH3" caption="Asynchronous Edge Detection Mode of EXTINT3" mask="0x8" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH4" caption="Asynchronous Edge Detection Mode of EXTINT4" mask="0x10" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH5" caption="Asynchronous Edge Detection Mode of EXTINT5" mask="0x20" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH6" caption="Asynchronous Edge Detection Mode of EXTINT6" mask="0x40" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH7" caption="Asynchronous Edge Detection Mode of EXTINT7" mask="0x80" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH8" caption="Asynchronous Edge Detection Mode of EXTINT8" mask="0x100" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH9" caption="Asynchronous Edge Detection Mode of EXTINT9" mask="0x200" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH10" caption="Asynchronous Edge Detection Mode of EXTINT10" mask="0x400" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH11" caption="Asynchronous Edge Detection Mode of EXTINT11" mask="0x800" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH12" caption="Asynchronous Edge Detection Mode of EXTINT12" mask="0x1000" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH13" caption="Asynchronous Edge Detection Mode of EXTINT13" mask="0x2000" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH14" caption="Asynchronous Edge Detection Mode of EXTINT14" mask="0x4000" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH15" caption="Asynchronous Edge Detection Mode of EXTINT15" mask="0x8000" values="EIC_ASYNCH__ASYNCH"/>
        </register>
        <register name="CONFIG0" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Sense Configuration">
          <bitfield name="SENSE0" caption="Input Sense Configuration 0" mask="0x7" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN0" caption="Filter Enable 0" mask="0x8"/>
          <bitfield name="SENSE1" caption="Input Sense Configuration 1" mask="0x70" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN1" caption="Filter Enable 1" mask="0x80"/>
          <bitfield name="SENSE2" caption="Input Sense Configuration 2" mask="0x700" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN2" caption="Filter Enable 2" mask="0x800"/>
          <bitfield name="SENSE3" caption="Input Sense Configuration 3" mask="0x7000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN3" caption="Filter Enable 3" mask="0x8000"/>
          <bitfield name="SENSE4" caption="Input Sense Configuration 4" mask="0x70000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN4" caption="Filter Enable 4" mask="0x80000"/>
          <bitfield name="SENSE5" caption="Input Sense Configuration 5" mask="0x700000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN5" caption="Filter Enable 5" mask="0x800000"/>
          <bitfield name="SENSE6" caption="Input Sense Configuration 6" mask="0x7000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN6" caption="Filter Enable 6" mask="0x8000000"/>
          <bitfield name="SENSE7" caption="Input Sense Configuration 7" mask="0x70000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN7" caption="Filter Enable 7" mask="0x80000000"/>
        </register>
        <register name="CONFIG1" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Sense Configuration">
          <bitfield name="SENSE8" caption="Input Sense Configuration 8" mask="0x7" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN8" caption="Filter Enable 8" mask="0x8"/>
          <bitfield name="SENSE9" caption="Input Sense Configuration 9" mask="0x70" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN9" caption="Filter Enable 9" mask="0x80"/>
          <bitfield name="SENSE10" caption="Input Sense Configuration 10" mask="0x700" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN10" caption="Filter Enable 10" mask="0x800"/>
          <bitfield name="SENSE11" caption="Input Sense Configuration 11" mask="0x7000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN11" caption="Filter Enable 11" mask="0x8000"/>
          <bitfield name="SENSE12" caption="Input Sense Configuration 12" mask="0x70000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN12" caption="Filter Enable 12" mask="0x80000"/>
          <bitfield name="SENSE13" caption="Input Sense Configuration 13" mask="0x700000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN13" caption="Filter Enable 13" mask="0x800000"/>
          <bitfield name="SENSE14" caption="Input Sense Configuration 14" mask="0x7000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN14" caption="Filter Enable 14" mask="0x8000000"/>
          <bitfield name="SENSE15" caption="Input Sense Configuration 15" mask="0x70000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN15" caption="Filter Enable 15" mask="0x80000000"/>
        </register>
